<?php

return [
    'add_title' => 'टिप्पणी जोडा',
    'placeholder' => 'तुमचा संदेश येथे लिहा...',
    'add_button' => 'टिप्पणी जोडा',
    'name' => 'तुमचं नाव टाका *',
    'phone' => 'तुमचा मोबाइल क्रमांक टाका *',
    'email' => 'तुमचा ईमेल पत्ता टाका *',
    'validation_required' => 'कृपया आपली टिप्पणी लिहा.',
    'success_message' => 'आपली टिप्पणी यशस्वीपणे पोस्ट झाली आहे!',
    'error_message' => 'काहीतरी चूक झाली. कृपया पुन्हा प्रयत्न करा.',
    'deleted_message' => 'आपली टिप्पणी यशस्वीरित्या हटवली गेली आहे.',
    'error_login_required' => 'काहीतरी चूक झाली आहे. कृपया लॉगिन करा किंवा पुन्हा प्रयत्न करा.',
    'no_comments' => 'अजून कोणत्याही प्रतिक्रिया नाहीत. तुमचे विचार सर्वप्रथम शेअर करा!',

    'validation' => [
        'name_required' => 'नाव आवश्यक आहे.',
        'phone_required' => 'मोबाइल क्रमांक आवश्यक आहे.',
        'email_required' => 'ईमेल फील्ड आवश्यक आहे.',
        'comment_required' => 'कृपया आपली टिप्पणी लिहा.',
    ],
];