<?php

return [
    'title_part1' => 'कृषी मराठी हे भारतातील सर्वात मोठ्या',
    'title_highlight' => 'मार्केटप्लेसपैकी एक आहे.',

    'subtitle_part1' => 'एक संपूर्ण',
    'subtitle_highlight1' => 'B2B',
    'subtitle_part2' => 'प्लॅटफॉर्म जिथे वापरकर्ते',
    'subtitle_highlight2' => 'खरेदी, विक्री आणि भाड्याने',
    'subtitle_part3' => 'शेतीसाठी व्यवहार करू शकतात.',

    'registered_users' => 'नोंदणीकृत वापरकर्ते',
    'sell_requirements' => 'विक्री गरजा',
    'buy_requirements' => 'खरेदी गरजा',
    'connected_users' => 'जोडलेले वापरकर्ते',

    'connecting_line' => 'अनेक विक्रेत्यांकडून मोफत दरपत्रके मिळवा',
    'enquiry_form' => 'आपली गरज आम्हाला सांगा',

    'tell_us_title' => 'तुम्हाला काय हवे आहे ते सांगा',
    'tell_us_need' => 'तुम्हाला काय हवे आहे ते सांगा, आम्ही योग्य पर्याय शोधायला मदत करू.',

    'receive_quotes_title' => 'विक्रेत्यांकडून मोफत दरपत्रके मिळवा',
    'receive_quotes' => 'विश्वासार्ह विक्रेत्यांकडून अनेक मोफत दरपत्रके मिळवा—कोणतेही लपवलेले शुल्क नाही.',

    'seal_deal_title' => 'व्यवहार अंतिम करा',
    'seal_deal' => 'तुलना करा, निवडा आणि आपल्या सोयीने सर्वोत्तम व्यवहार अंतिम करा.',

    'requirement_botton' => 'सबमिट करा',
    'requirement_placeholder' => 'उत्पादन / सेवा नाव टाका',
    'validation_required' => 'कृपया पुढे जाण्यासाठी सर्व आवश्यक माहिती भरा.',
    'success_message' => 'आपली गरज यशस्वीरित्या शेअर करण्यात आली आहे!',
    'error_message' => 'काहीतरी चूक झाली आहे.',

    'no_categories' => 'सध्या कोणतीही श्रेणी उपलब्ध नाही. कृपया नंतर पुन्हा तपासा.',
    'no_sub_categories' => 'या श्रेणीत सध्या कोणत्याही जाहिराती उपलब्ध नाहीत. कृपया नंतर पुन्हा पहा.',
    'no_ads_in_category' => 'या श्रेणीत कोणत्याही जाहिराती उपलब्ध नाहीत. कृपया दुसरी श्रेणी पहा.',
    'no_ads_in_sub_category' => 'या उप-श्रेणीत सध्या जाहिराती उपलब्ध नाहीत. कृपया नंतर पुन्हा पहा.',

    'no_ads_in_product' => 'या खरेदी-विक्री श्रेणीत सध्या कोणत्याही जाहिराती उपलब्ध नाहीत. कृपया दुसरी श्रेणी निवडा.',

    'validation' => [
        'requirement_required' => 'कृपया आपली गरज लिहा.',
    ],
];
