<?php

return [
    'title' => 'भारतभरातील शेतकरी व कृषी व्यावसायिकांशी जोडा',
    'subtitle' => 'भारतभरातील खरी व प्रामाणिक कृषी खरेदीदार व विक्रेत्यांशी जोडण्यासाठी आता नोंदणी करा.',
    'first_name' => 'तुमचं पहिले नाव टाका *',
    'last_name' => 'तुमचं आडनाव टाका *',
    'phone' => 'तुमचा मोबाइल क्रमांक टाका',
    'email' => 'तुमचा ईमेल पत्ता टाका',
    'password' => 'मजबूत पासवर्ड तयार करा',
    'confirm_password' => 'पासवर्ड पुन्हा टाका',
    'accept' => 'साइन इन करून, आपण आमच्या अटी आणि शर्ती आणि गोपनीयता धोरण सहमत आहात.',
    'submit' => 'खाते तयार करा',
    'account' => 'आधीपासून खाते आहे का?',
    'account_link' => 'लॉगिन',

    // jQuery validation messages
    'validation' => [
        'first_name_required' => 'पहिलं नाव आवश्यक आहे.',
        'last_name_required' => 'आडनाव आवश्यक आहे.',
        'phone_required' => 'मोबाइल क्रमांक आवश्यक आहे.',
        'phone_exists' => 'मोबाइल क्रमांक अमान्य आहे किंवा आधीच नोंदवलेला आहे.',
        'phone_exists_login' => 'हा मोबाईल नंबर आधीच नोंदणीकृत आहे. कृपया लॉगिन करा किंवा दुसरा मोबाईल क्रमांक वापरा आणि आपली गरज पोस्ट करा.',
        'email_required' => 'ईमेल फील्ड आवश्यक आहे.',
        'email_exists' => 'दर्ज केलेला ईमेल अमान्य आहे किंवा आधीच अस्तित्वात आहे.',
        'email_exists_login' => 'हा ईमेल आधीच नोंदणीकृत आहे. कृपया मोबाईल नंबरने लॉगिन करा किंवा नवीन ईमेल वापरा आणि आपली गरज पोस्ट करा.',
        'password_required' => 'पासवर्ड आवश्यक आहे.',
        'password_min' => 'पासवर्ड किमान 6 अक्षरांचा असावा.',
        'confirm_password_required' => 'पासवर्ड पुन्हा लिहा.',
        'confirm_password_match' => 'पासवर्ड जुळत नाही.',
    ],
];
