<?php

return [
    'add_title' => 'टिप्पणी जोड़ें',
    'placeholder' => 'अपना संदेश दर्ज करें...',
    'add_button' => 'टिप्पणी जोड़ें',
    'name' => 'अपना नाम दर्ज करें *',
    'phone' => 'अपना मोबाइल नंबर दर्ज करें *',
    'email' => 'अपना ईमेल पता दर्ज करें *',
    'success_message' => 'आपकी टिप्पणी सफलतापूर्वक पोस्ट की गई है!',
    'error_message' => 'कुछ गलत हो गया। कृपया पुनः प्रयास करें।',
    'deleted_message' => 'आपकी टिप्पणी सफलतापूर्वक हटाई गई है।',
    'error_login_required' => 'कुछ गलत हो गया। कृपया लॉगिन करें या फिर से प्रयास करें।',
    'no_comments' => 'अभी तक कोई टिप्पणी नहीं है। अपने विचार सबसे पहले साझा करें!',

    'validation' => [
        'name_required' => 'अपना नाम दर्ज करें *',
        'phone_required' => 'अपना मोबाइल नंबर दर्ज करें',
        'email_required' => 'अपना ईमेल पता दर्ज करें',
        'comment_required' => 'कृपया अपनी टिप्पणी दर्ज करें।',
    ],
];