<?php

return [
    'title_part1' => 'कृषि मराठी भारत के सबसे बड़े',
    'title_highlight' => 'मार्केटप्लेस में से एक है।',

    'subtitle_part1' => 'एक संपूर्ण',
    'subtitle_highlight1' => 'B2B',
    'subtitle_part2' => 'प्लेटफ़ॉर्म है जहाँ उपयोगकर्ता',
    'subtitle_highlight2' => 'खरीद, बिक्री और किराए पर',
    'subtitle_part3' => 'कृषि कर सकते हैं।',

    'registered_users' => 'पंजीकृत उपयोगकर्ता',
    'sell_requirements' => 'बिक्री की आवश्यकताएँ',
    'buy_requirements' => 'खरीद की आवश्यकताएँ',
    'connected_users' => 'जुड़े हुए उपयोगकर्ता',

    'connecting_line' => 'कई विक्रेताओं से मुफ्त में कोटेशन प्राप्त करें',
    'enquiry_form' => 'हमें अपनी आवश्यकता बताएं',

    'tell_us_title' => 'हमें बताएं कि आपको क्या चाहिए',
    'tell_us_need' => 'हमें बताएं कि आपको क्या चाहिए, हम आपकी मदद करेंगे सही विकल्प चुनने में।',

    'receive_quotes_title' => 'विक्रेताओं से मुफ्त कोटेशन प्राप्त करें',
    'receive_quotes' => 'विश्वसनीय विक्रेताओं से कई मुफ्त कोटेशन पाएं—कोई छुपा शुल्क नहीं।',

    'seal_deal_title' => 'सौदा पक्का करें',
    'seal_deal' => 'तुलना करें, चुनें और अपनी सुविधा अनुसार सबसे अच्छा सौदा तय करें।',

    'requirement_botton' => 'सबमिट करें',
    'requirement_placeholder' => 'उत्पाद / सेवा का नाम दर्ज करें',
    'validation_required' => 'कृपया आगे बढ़ने के लिए सभी आवश्यक फ़ील्ड भरें।',
    'success_message' => 'आपकी आवश्यकता सफलतापूर्वक साझा कर दी गई है!',
    'error_message' => 'कुछ गलत हो गया।',

    'no_categories' => 'वर्तमान में कोई श्रेणियाँ उपलब्ध नहीं हैं। कृपया बाद में पुनः प्रयास करें।',
    'no_sub_categories' => 'इस श्रेणी में अभी कोई विज्ञापन उपलब्ध नहीं है। कृपया बाद में देखें।',
    'no_ads_in_category' => 'इस श्रेणी में कोई विज्ञापन उपलब्ध नहीं है। कृपया अन्य श्रेणी देखें।',
    'no_ads_in_sub_category' => 'इस उप-श्रेणी में कोई विज्ञापन नहीं मिला। कृपया बाद में फिर प्रयास करें।',

    'no_ads_in_product' => 'इस खरीद-बिक्री श्रेणी में फिलहाल कोई विज्ञापन उपलब्ध नहीं है। कृपया कोई दूसरी श्रेणी आज़माएं।',

    'validation' => [
        'requirement_required' => 'कृपया अपनी आवश्यकता दर्ज करें।',
    ],
];
