<?php

return [
    'title' => 'भारत के किसानों और कृषि व्यवसायों से जुड़ें',
    'subtitle' => 'भारत भर के विश्वसनीय कृषि खरीदारों और विक्रेताओं से जुड़ने के लिए अभी पंजीकरण करें।',
    'first_name' => 'अपना पहला नाम दर्ज करें *',
    'last_name' => 'अपना उपनाम दर्ज करें *',
    'phone' => 'अपना मोबाइल नंबर दर्ज करें',
    'email' => 'अपना ईमेल पता दर्ज करें',
    'password' => 'मजबूत पासवर्ड बनाएं',
    'confirm_password' => 'पासवर्ड की पुष्टि करें',
    'accept' => 'लॉग इन करके, आप हमारे और नियमों और शर्तों और गोपनीयता नीति के अनुसार हैं',
    'submit' => 'खाता बनाएं',
    'account' => 'क्या आपके पास पहले से एक खाता मौजूद है?',
    'account_link' => 'लॉगिन करें',

    // jQuery validation messages
    'validation' => [
        'first_name_required' => 'पहला नाम अनिवार्य है।',
        'last_name_required' => 'उपनाम अनिवार्य है।',
        'phone_required' => 'मोबाइल नंबर अनिवार्य है।',
        'phone_exists' => 'मोबाइल नंबर अमान्य है या पहले से मौजूद है।',
        'phone_exists_login' => 'यह मोबाइल नंबर पहले से पंजीकृत है। कृपया लॉगिन करें या कोई दूसरा नंबर उपयोग करें और अपनी आवश्यकता पोस्ट करें।',
        'email_required' => 'ईमेल फ़ील्ड आवश्यक है।',
        'email_exists' => 'दर्ज किया गया ईमेल अमान्य है या पहले से मौजूद है।',
        'email_exists_login' => 'यह ईमेल पहले से पंजीकृत है। कृपया अपने मोबाइल नंबर से लॉगिन करें या दूसरा ईमेल उपयोग करें और अपनी आवश्यकता पोस्ट करें।',
        'password_required' => 'पासवर्ड अनिवार्य है।',
        'password_min' => 'पासवर्ड कम से कम 6 अक्षरों का होना चाहिए।',
        'confirm_password_required' => 'कृपया पासवर्ड की पुष्टि करें।',
        'confirm_password_match' => 'पासवर्ड मेल नहीं खा रहा है।',
    ],
];